awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f090xB.h
/********************************************************************************************************************/
/********************************* LCD ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for LCD_CR register ***********************************************/
#define LCD_CR_EN_Pos                             (0U)
#define LCD_CR_EN_Msk                             (0x1UL<<LCD_CR_EN_Pos)                            /*!< 0x00000001 */
#define LCD_CR_EN                                 LCD_CR_EN_Msk                                     
#define LCD_CR_LCDCLK_Pos                         (1U)
#define LCD_CR_LCDCLK_Msk                         (0x3UL<<LCD_CR_LCDCLK_Pos)                        /*!< 0x00000006 */
#define LCD_CR_LCDCLK                             LCD_CR_LCDCLK_Msk
#define LCD_CR_LCDCLK_0                           (0x1UL<<LCD_CR_LCDCLK_Pos)                        /*!< 0x00000002 */
#define LCD_CR_LCDCLK_1                           (0x2UL<<LCD_CR_LCDCLK_Pos)                        /*!< 0x00000004 */
#define LCD_CR_BIAS_Pos                           (4U)
#define LCD_CR_BIAS_Msk                           (0x3UL<<LCD_CR_BIAS_Pos)                          /*!< 0x00000030 */
#define LCD_CR_BIAS                               LCD_CR_BIAS_Msk
#define LCD_CR_BIAS_0                             (0x1UL<<LCD_CR_BIAS_Pos)                          /*!< 0x00000010 */
#define LCD_CR_BIAS_1                             (0x2UL<<LCD_CR_BIAS_Pos)                          /*!< 0x00000020 */
#define LCD_CR_DUTY_Pos                           (6U)
#define LCD_CR_DUTY_Msk                           (0x7UL<<LCD_CR_DUTY_Pos)                          /*!< 0x000001C0 */
#define LCD_CR_DUTY                               LCD_CR_DUTY_Msk
#define LCD_CR_DUTY_0                             (0x1UL<<LCD_CR_DUTY_Pos)                          /*!< 0x00000040 */
#define LCD_CR_DUTY_1                             (0x2UL<<LCD_CR_DUTY_Pos)                          /*!< 0x00000080 */
#define LCD_CR_DUTY_2                             (0x4UL<<LCD_CR_DUTY_Pos)                          /*!< 0x00000100 */
#define LCD_CR_BSEL_Pos                           (9U)
#define LCD_CR_BSEL_Msk                           (0x3UL<<LCD_CR_BSEL_Pos)                          /*!< 0x00000600 */
#define LCD_CR_BSEL                               LCD_CR_BSEL_Msk
#define LCD_CR_BSEL_0                             (0x1UL<<LCD_CR_BSEL_Pos)                          /*!< 0x00000200 */
#define LCD_CR_BSEL_1                             (0x2UL<<LCD_CR_BSEL_Pos)                          /*!< 0x00000400 */
#define LCD_CR_CONTRAST_Pos                       (12U)
#define LCD_CR_CONTRAST_Msk                       (0xFUL<<LCD_CR_CONTRAST_Pos)                      /*!< 0x0000F000 */
#define LCD_CR_CONTRAST                           LCD_CR_CONTRAST_Msk
#define LCD_CR_CONTRAST_0                         (0x1UL<<LCD_CR_CONTRAST_Pos)                      /*!< 0x00001000 */
#define LCD_CR_CONTRAST_1                         (0x2UL<<LCD_CR_CONTRAST_Pos)                      /*!< 0x00002000 */
#define LCD_CR_CONTRAST_2                         (0x4UL<<LCD_CR_CONTRAST_Pos)                      /*!< 0x00004000 */
#define LCD_CR_CONTRAST_3                         (0x8UL<<LCD_CR_CONTRAST_Pos)                      /*!< 0x00008000 */
//#define LCD_CR_VSEL_Pos                           (16U)
//#define LCD_CR_VSEL_Msk                           (0x1UL<<LCD_CR_VSEL_Pos)                          /*!< 0x00010000 */
//#define LCD_CR_VSEL                               LCD_CR_VSEL_Msk                                   
//#define LCD_CR_VCP_SEL_Pos                        (17U)
//#define LCD_CR_VCP_SEL_Msk                        (0x7UL<<LCD_CR_VCP_SEL_Pos)                       /*!< 0x000E0000 */
//#define LCD_CR_VCP_SEL                            LCD_CR_VCP_SEL_Msk
//#define LCD_CR_VCP_SEL_0                          (0x1UL<<LCD_CR_VCP_SEL_Pos)                       /*!< 0x00020000 */
//#define LCD_CR_VCP_SEL_1                          (0x2UL<<LCD_CR_VCP_SEL_Pos)                       /*!< 0x00040000 */
//#define LCD_CR_VCP_SEL_2                          (0x4UL<<LCD_CR_VCP_SEL_Pos)                       /*!< 0x00080000 */
#define LCD_CR_COMSEG_DRV_TYPE_Pos                (20U)
#define LCD_CR_COMSEG_DRV_TYPE_Msk                (0x1UL<<LCD_CR_COMSEG_DRV_TYPE_Pos)               /*!< 0x00100000 */
#define LCD_CR_COMSEG_DRV_TYPE                    LCD_CR_COMSEG_DRV_TYPE_Msk
#define LCD_CR_FCCTL_Pos                          (21U)
#define LCD_CR_FCCTL_Msk                          (0x7UL<<LCD_CR_FCCTL_Pos)                         /*!< 0x00E00000 */
#define LCD_CR_FCCTL                              LCD_CR_FCCTL_Msk
#define LCD_CR_FCCTL_0                            (0x1UL<<LCD_CR_FCCTL_Pos)                         /*!< 0x00200000 */
#define LCD_CR_FCCTL_1                            (0x2UL<<LCD_CR_FCCTL_Pos)                         /*!< 0x00400000 */
#define LCD_CR_FCCTL_2                            (0x4UL<<LCD_CR_FCCTL_Pos)                         /*!< 0x00800000 */
#define LCD_CR_DEAD_Pos                           (24U)
#define LCD_CR_DEAD_Msk                           (0x7UL<<LCD_CR_DEAD_Pos)                          /*!< 0x07000000 */
#define LCD_CR_DEAD                               LCD_CR_DEAD_Msk
#define LCD_CR_DEAD_0                             (0x1UL<<LCD_CR_DEAD_Pos)                          /*!< 0x01000000 */
#define LCD_CR_DEAD_1                             (0x2UL<<LCD_CR_DEAD_Pos)                          /*!< 0x02000000 */
#define LCD_CR_DEAD_2                             (0x4UL<<LCD_CR_DEAD_Pos)                          /*!< 0x04000000 */
//#define LCD_CR_CP_FRQ_Pos                         (27U)
//#define LCD_CR_CP_FRQ_Msk                         (0x7UL<<LCD_CR_CP_FRQ_Pos)                        /*!< 0x38000000 */
//#define LCD_CR_CP_FRQ                             LCD_CR_CP_FRQ_Msk
//#define LCD_CR_CP_FRQ_0                           (0x1UL<<LCD_CR_CP_FRQ_Pos)                        /*!< 0x08000000 */
//#define LCD_CR_CP_FRQ_1                           (0x2UL<<LCD_CR_CP_FRQ_Pos)                        /*!< 0x10000000 */
//#define LCD_CR_CP_FRQ_2                           (0x4UL<<LCD_CR_CP_FRQ_Pos)                        /*!< 0x20000000 */
//#define LCD_CR_CP_ST_Pos                          (30U)
//#define LCD_CR_CP_ST_Msk                          (0x3UL<<LCD_CR_CP_ST_Pos)                         /*!< 0xC0000000 */
//#define LCD_CR_CP_ST                              LCD_CR_CP_ST_Msk
//#define LCD_CR_CP_ST_0                            (0x1UL<<LCD_CR_CP_ST_Pos)                         /*!< 0x40000000 */
//#define LCD_CR_CP_ST_1                            (0x2UL<<LCD_CR_CP_ST_Pos)                         /*!< 0x80000000 */

/********************************* Bit definition for LCD_CSR register **********************************************/
#define LCD_CSR_BLINKCNT_Pos                      (0U)
#define LCD_CSR_BLINKCNT_Msk                      (0x3FUL<<LCD_CSR_BLINKCNT_Pos)                    /*!< 0x0000003F */
#define LCD_CSR_BLINKCNT                          LCD_CSR_BLINKCNT_Msk
#define LCD_CSR_BLINKCNT_0                        (0x1UL<<LCD_CSR_BLINKCNT_Pos)                     /*!< 0x00000001 */
#define LCD_CSR_BLINKCNT_1                        (0x2UL<<LCD_CSR_BLINKCNT_Pos)                     /*!< 0x00000002 */
#define LCD_CSR_BLINKCNT_2                        (0x4UL<<LCD_CSR_BLINKCNT_Pos)                     /*!< 0x00000004 */
#define LCD_CSR_BLINKCNT_3                        (0x8UL<<LCD_CSR_BLINKCNT_Pos)                     /*!< 0x00000008 */
#define LCD_CSR_BLINKCNT_4                        (0x10UL<<LCD_CSR_BLINKCNT_Pos)                    /*!< 0x00000010 */
#define LCD_CSR_BLINKCNT_5                        (0x20UL<<LCD_CSR_BLINKCNT_Pos)                    /*!< 0x00000020 */
#define LCD_CSR_BLINKEN_Pos                       (6U)
#define LCD_CSR_BLINKEN_Msk                       (0x1UL<<LCD_CSR_BLINKEN_Pos)                      /*!< 0x00000040 */
#define LCD_CSR_BLINKEN                           LCD_CSR_BLINKEN_Msk                               
#define LCD_CSR_SWCAP_DRV_NUM_Pos                 (7U)
#define LCD_CSR_SWCAP_DRV_NUM_Msk                 (0x7UL<<LCD_CSR_SWCAP_DRV_NUM_Pos)                /*!< 0x00000380 */
#define LCD_CSR_SWCAP_DRV_NUM                     LCD_CSR_SWCAP_DRV_NUM_Msk
#define LCD_CSR_SWCAP_DRV_NUM_0                   (0x1UL<<LCD_CSR_SWCAP_DRV_NUM_Pos)                /*!< 0x00000080 */
#define LCD_CSR_SWCAP_DRV_NUM_1                   (0x2UL<<LCD_CSR_SWCAP_DRV_NUM_Pos)                /*!< 0x00000100 */
#define LCD_CSR_SWCAP_DRV_NUM_2                   (0x4UL<<LCD_CSR_SWCAP_DRV_NUM_Pos)                /*!< 0x00000200 */
#define LCD_CSR_MODE_Pos                          (10U)
#define LCD_CSR_MODE_Msk                          (0x1UL<<LCD_CSR_MODE_Pos)                         /*!< 0x00000400 */
#define LCD_CSR_MODE                              LCD_CSR_MODE_Msk                                                                
#define LCD_CSR_BKFIE_Pos                         (12U)
#define LCD_CSR_BKFIE_Msk                         (0x1UL<<LCD_CSR_BKFIE_Pos)                        /*!< 0x00001000 */
#define LCD_CSR_BKFIE                             LCD_CSR_BKFIE_Msk                                 
#define LCD_CSR_SOFIE_Pos                         (13U)
#define LCD_CSR_SOFIE_Msk                         (0x1UL<<LCD_CSR_SOFIE_Pos)                        /*!< 0x00002000 */
#define LCD_CSR_SOFIE                             LCD_CSR_SOFIE_Msk                                 
#define LCD_CSR_UDDIE_Pos                         (14U)
#define LCD_CSR_UDDIE_Msk                         (0x1UL<<LCD_CSR_UDDIE_Pos)                        /*!< 0x00004000 */
#define LCD_CSR_UDDIE                             LCD_CSR_UDDIE_Msk                                 
#define LCD_CSR_UDR_Pos                           (15U)
#define LCD_CSR_UDR_Msk                           (0x1UL<<LCD_CSR_UDR_Pos)                          /*!< 0x00008000 */
#define LCD_CSR_UDR                               LCD_CSR_UDR_Msk                                   
#define LCD_CSR_BKF_Pos                           (16U)
#define LCD_CSR_BKF_Msk                           (0x1UL<<LCD_CSR_BKF_Pos)                          /*!< 0x00010000 */
#define LCD_CSR_BKF                               LCD_CSR_BKF_Msk                                   
#define LCD_CSR_SOF_Pos                           (17U)
#define LCD_CSR_SOF_Msk                           (0x1UL<<LCD_CSR_SOF_Pos)                          /*!< 0x00020000 */
#define LCD_CSR_SOF                               LCD_CSR_SOF_Msk                                   
#define LCD_CSR_UDD_Pos                           (18U)
#define LCD_CSR_UDD_Msk                           (0x1UL<<LCD_CSR_UDD_Pos)                          /*!< 0x00040000 */
#define LCD_CSR_UDD                               LCD_CSR_UDD_Msk                                   
#define LCD_CSR_ENS_Pos                           (19U)
#define LCD_CSR_ENS_Msk                           (0x1UL<<LCD_CSR_ENS_Pos)                          /*!< 0x00080000 */
#define LCD_CSR_ENS                               LCD_CSR_ENS_Msk                                   

